Evangelos_Constantinou_Teaching_Statement.tex
% Created 2021-10-26 Tue 09:51
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[T1]{fontenc} % allows INPUT accented characters from keyboard
\usepackage[latin9]{inputenc} % orientated to OUTPUT, what fonts to use for printing character
\usepackage{geometry}
\geometry{verbose} % allows messages of overrun lines
\usepackage{setspace}
\usepackage{calc} % match expressions in \setcounter \setspace and so on
\usepackage{titlesec} % modify sections and etc.
\usepackage[bottom]{footmisc} % footnote options
\usepackage{babel} % multiligual (human langs) support for latex, luatex and etc.
\usepackage{tabularx,booktabs}
\usepackage[unicode=true,pdfusetitle,bookmarks=true,bookmarksnumbered=false,bookmarksopen=false,breaklinks=false,backref=false,colorlinks=false]{hyperref}
\hypersetup{colorlinks = true, urlcolor = magenta, colorlinks = blue, linkcolor = magenta, citecolor = blue}
\usepackage{breakurl}
\titlespacing\section{0pt}{\parskip}{}
\setlength{\textwidth}{6.5in}
\setlength{\textheight}{9in}
\setlength{\topmargin}{-0.5in}
\setlength{\oddsidemargin}{0in}
\setlength{\parskip}{.05in}
\author{Evangelos Constantinou}
\date{}
\title{\bf{Teaching Statement}}
\hypersetup{
 pdfauthor={Evangelos Constantinou},
 pdftitle={\bf{Teaching Statement}},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
As a first generation college graduate, I know the impact teaching can have on a student's life.
My experience has shown me that the best teaching methods facilitate learning, not rote memorization.
Effective teaching helps students discover the answer, and sharpens their understanding of key concepts in the process.
My goal is for my students to develop a long-lasting interest in economics and politics,
and gain insights that will serve them beyond the classroom.

I truly enjoy teaching.
It gives me the opportunity to not only share knowledge, but also create it with my students.
Teaching always helps me clarify abstract ideas and through teaching I find new ways to present difficult concepts in a relatable and clear manner.
This informs how I undertake research, think through my questions, and effectively communicate my goals and findings.

I am fortunate to have  taught several exciting  courses in my career.
During my time at the University of Illinois, I served as a Teaching Assistant, and a Head Teaching Assistant for the introductory microeconomics class by Dr. Isaac DiIanni.
Most students were in their first year, working on a wide range of majors from economics and finance to physics and music.
Although the material was assigned by Dr. DiIanni, the teaching format was left to me to create and implement.
I find it most effective to break the students into smaller groups of four or five members,
and ask them to discuss three to four questions I provide relating to the course material.
In the meantime, I check with each group and ask them to explain the questions to me, and I try to guide them to critically think about the content of each question.
After fifteen minutes, I open the discussion to the whole class.
I provide a general argument for each question, and I ask them to challenge my reasoning or defend it using the tools taught in class.
Once an idea or theory is developed, I highlight loose ends in the reasoning, and guide the students in crafting a more precise argument.
I find that this helps students engage with the material in an accessible way,
apply what they have learned to everyday situations,
and allows them to think analytically and critically.
Being selected by my students as "Teacher Ranked as Excellent" (top 10\% in the university) was a true honor and reflects the positive impact my instruction had on students throughout my time at UIUC.
As an addendum, feedback forms by the students are attached. 

Prior to my studies at the University of Illinois, I served as Special Teaching staff at the University of Cyprus for four semesters.
This was a rewarding experience focused exclusively on teaching.
Each semester I was assigned 12 to 16 teaching hours for a wide range of classes such as microeconomics, statistics and econometrics, and mathematical economics.
The opportunity to teach such a variety of classes and reach hundreds of students in a semester was a truly gratifying experience, despite the significant  teaching load.
I also independently expanded my office hours, which gave me the opportunity to interact with my students in smaller groups.
Since I was in Cyprus during the financial crisis of 2013, these office hours often applied the material covered in class to explain the real-life phenomena Cyprus was experiencing at the time.

As a professor, I will be delighted to teach at any level, graduate or undergraduate.
I bring special knowledge to courses on political economy, industrial organization, American politics, microeconomics, quantitative methods and econometrics,
but I would also find it rewarding, and a learning opportunity, to teach outside these areas.
\end{document}